:- op(740,xfx,[∈, ⊑ , ˄, $]).
:- op(900,xfx,ⱶs).
:- op(1200, xfx, --).
term_expansion((A--B), (B:-A)).

(X : Ⳓ) ∈ Γ :- member(X : Ⳓ, Γ).

% Instantiation
∀(Γ,Ʈ) ⊑ Ʈʹ :- copy_term(∀(Γ,Ʈ),∀(Γ,Ʈʹ)).
m(Ʈ) ⊑ Ʈ.

% Generalization
Γ˄(Ʈ) : ∀(Γ,Ʈ).

% Syntactical Rule System

atom(X), (X : Ⳓ) ∈ Γ, Ⳓ ⊑ Ʈ
--%-------------------------        [Var]
Γ ⱶs X : Ʈ.

Γ ⱶs E0 : (Ʈ -> Ʈʹ), Γ ⱶs E1 : Ʈ
--%-------------------------------- [App]
Γ ⱶs (E0 $ E1) : Ʈʹ.

[X : m(Ʈ)|Γ] ⱶs E : Ʈʹ
--%------------------               [Abs]
Γ ⱶs fun(X->E) : (Ʈ -> Ʈʹ).

Γ ⱶs E0 : Ʈ, Γ˄(Ʈ) : ΓƮ, [X : ΓƮ|Γ] ⱶs E1 : Ʈʹ
--%------------------------------------------- [Let]
Γ ⱶs let(X = E0; E1) : Ʈʹ.

:- [] ⱶs fun(x->x) : (Ʈ->Ʈ).
:- [] ⱶs let(id=fun(x->x); id $ id) : (Ʈ->Ʈ).

:- halt.
